#Создать калькулятор
# 1) Работа по действиям
# 2) Логирование
# 3) выражения

def input_data(text):
    return int(input(text))

def view_data(text, data):
    print(f'{text}{data}')




